### Ordinal Number Encoding

Grading system --- A, B, C, D, F

- A - 1
- B - 2
- C - 3
- D - 4
- F - 5

Experience of a Batsman

- A - 10 -- 1
- B - 5  -- 2
- C - 3  -- 3

Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday

Sun -- 5
Sat -- 4
Mon -- 1

In [2]:
import datetime

In [3]:
today_date = datetime.datetime.today()

In [4]:
today_date

datetime.datetime(2023, 3, 8, 12, 8, 27, 803977)

In [5]:
today_date - datetime.timedelta(1)

datetime.datetime(2023, 3, 7, 12, 8, 27, 803977)

In [7]:
#### List Comprehension
days = [today_date - datetime.timedelta(x) for x in range(0, 15)]

In [8]:
import pandas as pd
data = pd.DataFrame(days)
data.columns = ['Day']

In [9]:
data.head()

                         Day
0 2023-03-08 12:08:27.803977
1 2023-03-07 12:08:27.803977
2 2023-03-06 12:08:27.803977
3 2023-03-05 12:08:27.803977
4 2023-03-04 12:08:27.803977

In [43]:
data['weekday'] = data['Day'].dt.day_name()
data.head()

                         Day    weekday
0 2023-03-08 12:08:27.803977  Wednesday
1 2023-03-07 12:08:27.803977    Tuesday
2 2023-03-06 12:08:27.803977     Monday
3 2023-03-05 12:08:27.803977     Sunday
4 2023-03-04 12:08:27.803977   Saturday

In [44]:
dictionary = {'Monday' :   1,
              'Tuesday':   2,
              'Wednesday': 3,
              'Thursday':  4,
              'Friday':    5,
              'Saturday':  6,
              'Sunday':    7  
}

In [45]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [47]:
data['weekday_ordinal'] = data['weekday'].map(dictionary)

In [48]:
data

                          Day    weekday  weekday_ordinal
0  2023-03-08 12:08:27.803977  Wednesday                3
1  2023-03-07 12:08:27.803977    Tuesday                2
2  2023-03-06 12:08:27.803977     Monday                1
3  2023-03-05 12:08:27.803977     Sunday                7
4  2023-03-04 12:08:27.803977   Saturday                6
5  2023-03-03 12:08:27.803977     Friday                5
6  2023-03-02 12:08:27.803977   Thursday                4
7  2023-03-01 12:08:27.803977  Wednesday                3
8  2023-02-28 12:08:27.803977    Tuesday                2
9  2023-02-27 12:08:27.803977     Monday                1
10 2023-02-26 12:08:27.803977     Sunday                7
11 2023-02-25 12:08:27.803977   Saturday                6
12 2023-02-24 12:08:27.803977     Friday                5
13 2023-02-23 12:08:27.803977   Thursday                4
14 2023-02-22 12:08:27.803977  Wednesday                3

### Count or Frequency Encoding

In [51]:
train_set = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header = None)
train_set.head()

   0                  1       2           3   4                    5   ...       9     10 11  12              13      14
0  39          State-gov   77516   Bachelors  13        Never-married  ...     Male  2174  0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  13   Married-civ-spouse  ...     Male     0  0  13   United-States   <=50K
2  38            Private  215646     HS-grad   9             Divorced  ...     Male     0  0  40   United-States   <=50K
3  53            Private  234721        11th   7   Married-civ-spouse  ...     Male     0  0  40   United-States   <=50K
4  28            Private  338409   Bachelors  13   Married-civ-spouse  ...   Female     0  0  40            Cuba   <=50K

[5 rows x 15 columns]

In [53]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [54]:
len(train_set[1].unique())

9

In [56]:
columns = [1,3,5,6,7,8,9,13]

In [58]:
train_set = train_set[columns]

In [60]:
train_set.columns = ['Employment', 'Degree', 'Status', 'Designation', 'Family_job', 'Race', 'Sex', 'Country']

In [61]:
train_set.head()

          Employment      Degree               Status  ...    Race      Sex         Country
0          State-gov   Bachelors        Never-married  ...   White     Male   United-States
1   Self-emp-not-inc   Bachelors   Married-civ-spouse  ...   White     Male   United-States
2            Private     HS-grad             Divorced  ...   White     Male   United-States
3            Private        11th   Married-civ-spouse  ...   Black     Male   United-States
4            Private   Bachelors   Married-civ-spouse  ...   Black   Female            Cuba

[5 rows x 8 columns]

In [62]:
for feature in train_set.columns:
    print(feature, ':', len(train_set[feature].unique()), 'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
Family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [65]:
country_map = train_set['Country'].value_counts().to_dict()

In [66]:
train_set['Country'] = train_set['Country'].map(country_map)

In [67]:
train_set.head()

          Employment      Degree               Status         Designation      Family_job    Race      Sex  Country
0          State-gov   Bachelors        Never-married        Adm-clerical   Not-in-family   White     Male    29170
1   Self-emp-not-inc   Bachelors   Married-civ-spouse     Exec-managerial         Husband   White     Male    29170
2            Private     HS-grad             Divorced   Handlers-cleaners   Not-in-family   White     Male    29170
3            Private        11th   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male    29170
4            Private   Bachelors   Married-civ-spouse      Prof-specialty            Wife   Black   Female       95

#### Advantages
1. Easy to use
2. Not increasing any feature space

#### Disadvantages
1. It will try to provide the same weight if the frequencies are same

### Target guided Ordinal Encoding

1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [68]:
import pandas as pd

In [69]:
df = pd.read_csv('titanic.csv', usecols = ['Cabin', 'Survived'])

In [70]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [71]:
df['Cabin'].fillna('Missing', inplace = True)

In [73]:
df.head(20)

    Survived    Cabin
0          0  Missing
1          1      C85
2          1  Missing
3          1     C123
4          0  Missing
5          0  Missing
6          0      E46
7          0  Missing
8          1  Missing
9          1  Missing
10         1       G6
11         1     C103
12         0  Missing
13         0  Missing
14         0  Missing
15         1  Missing
16         0  Missing
17         1  Missing
18         0  Missing
19         1  Missing

In [78]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [79]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [80]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [84]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [85]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [86]:
ordinal_labels2 = {k:i for i,k in enumerate(ordinal_labels, 0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [87]:
df['Cabin_ordinal_labels'] = df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

##### Now we can delete the Cabin column as we have converted its importance in another column in numerical format

### Mean Encoding

In [89]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [90]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [91]:
df['mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)
df.head()

#### This provides a monotonic relation

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

##### Advantages
* Capture information within the label, therefore rendering more predictive features
* Creates a monotonic relationship between the variable and the target
* Does not expand the feature space

##### Disadvantage
* Prone to cause over-fitting